<a href="https://colab.research.google.com/github/Jiablero/Disasters/blob/master/Lusitania_season1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Подготовка данных о пасажирах и команде "Луизитании", находившихся на борту во время гибели судна. 

Данные взяты отсюда: https://www.rmslusitania.info/multimedia/downloads/

In [1]:
import pandas as pd

In [5]:
data = pd.read_excel('/content/drive/My Drive/disasters/lui_completemanifest.xls',  index_col = False)

In [22]:
data.groupby('Fate').aggregate({'Fate': 'count'})

                          Fate
Fate
Lost                      1193
Not on board                 1
Saved                      763
Saved (died from trauma)     4

In [32]:
data = data.drop(['Department/Class', 'Citizenship', 'Status', 'City', 'County', 'State', 'Country', 'Lifeboat', 'Rescue Vessel', 'Body No.', 'Cabin No.', 'Traveling Companions and other notes', 'Ticket No.', 'Value', 'Adult/Minor'], axis=1)

In [38]:
data.isnull().sum()

Family name          0
Title                0
Personal name        3
Fate                 0
Age                653
Passenger/Crew       0
Position          1270
Sex                  0
dtype: int64

In [44]:
data[(data.Position.isna()) & (data['Passenger/Crew'] == 'Crew')]
# остальные с Position = NAN - пассажиры

  Family name Title Personal name  Fate Age Passenger/Crew Position   Sex
0     CAMERON   Mr.    Charles W.  Lost  38           Crew      NaN  Male
1  CARR-JONES   Mr.            E.  Lost  37           Crew      NaN  Male